HELYXcore-4.4.0/examples/legacy/incompressible/pimpleFoam/LES/turbulentInflow/0/inlet.reducedDigitalFilter/U
/*--------------------------------*- C++ -*----------------------------------*\
|       o        |                                                            |
|    o     o     |  HELYX (R) : Open-source CFD for Enterprise                |
|   o   O   o    |  Version : 4.4.0                                           |
|    o     o     |  ENGYS Ltd. <http://engys.com/>                            |
|       o        |                                                            |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

inlet
{
    type                turbulentDigitalFilterInlet;
    variant             reducedDigitalFilter;
    planeDivisions      ( 64 70 );
    L                   ( 0.78035508 0.31085352 0.342261 0.1728125 0.171875
                          0.22459375 0.172787596 0.171889998 0.224578995 );
    patchNormalSpeed    20.133;
}

// ************************************************************************* //
