HELYXcore-4.4.0/examples/legacy/incompressible/pimpleFoam/LES/turbulentInflow/0/nut
/*--------------------------------*- C++ -*----------------------------------*\
|       o        |                                                            |
|    o     o     |  HELYX (R) : Open-source CFD for Enterprise                |
|   o   O   o    |  Version : 4.4.0                                           |
|    o     o     |  ENGYS Ltd. <http://engys.com/>                            |
|       o        |                                                            |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    bottomWall
    {
        type            zeroGradient;
    }
    topWall
    {
        type            zeroGradient;
    }
    sides_half0
    {
        type            cyclic;
    }
    sides_half1
    {
        type            cyclic;
    }
    inlet
    {
        type            calculated;
        value           uniform 1e-08;
    }
    outlet
    {
        type            calculated;
        value           uniform 1e-08;
    }
}


// ************************************************************************* //
